Переиндексация

In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'e', 'a', 'b'])
obj

d    4.5
e    7.2
a   -5.3
b    3.6
dtype: float64

In [2]:
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    3.6
c    NaN
d    4.5
e    7.2
dtype: float64

In [3]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [4]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [5]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
index=['a', 'c', 'd'],
columns=['Chelyabinsk', 'Magnitogorsk', 'Verkhneuralsk'])
frame

   Chelyabinsk  Magnitogorsk  Verkhneuralsk
a            0             1              2
c            3             4              5
d            6             7              8

In [6]:
frame2 = frame.reindex(['a', 'b', 'c', 'd'])
frame2

   Chelyabinsk  Magnitogorsk  Verkhneuralsk
a          0.0           1.0            2.0
b          NaN           NaN            NaN
c          3.0           4.0            5.0
d          6.0           7.0            8.0

In [7]:
cities = ['Magnitogorsk', 'Verkhneuralsk']
frame.reindex(columns=cities)

   Magnitogorsk  Verkhneuralsk
a             1              2
c             4              5
d             7              8

In [8]:
frame.loc[['a', 'c', 'd'], cities]

   Magnitogorsk  Verkhneuralsk
a             1              2
c             4              5
d             7              8

Удаление элементов из оси

In [9]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
obj = pd.Series(np.arange(6.), index=['a', 'b', 'c', 'd', 'e', 'f'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
f    5.0
dtype: float64

In [10]:
new_obj = obj.drop('c')
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
f    5.0
dtype: float64

In [11]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
f    5.0
dtype: float64

In [12]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=['Chelyabinsk', 'Magnitogorsk', 'Uchali', 'Miass'],
columns=['one', 'two', 'three', 'four'])
data

              one  two  three  four
Chelyabinsk     0    1      2     3
Magnitogorsk    4    5      6     7
Uchali          8    9     10    11
Miass          12   13     14    15

In [13]:
data.drop(['Magnitogorsk', 'Chelyabinsk'])

        one  two  three  four
Uchali    8    9     10    11
Miass    12   13     14    15

In [14]:
data.drop('two', axis=1)

              one  three  four
Chelyabinsk     0      2     3
Magnitogorsk    4      6     7
Uchali          8     10    11
Miass          12     14    15

In [15]:
data.drop(['two', 'four'], axis='columns')

              one  three
Chelyabinsk     0      2
Magnitogorsk    4      6
Uchali          8     10
Miass          12     14

In [16]:
obj.drop('c', inplace=True)
obj

a    0.0
b    1.0
d    3.0
e    4.0
f    5.0
dtype: float64

Доступ по индексу, выборка и фильтрация

In [17]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
obj = pd.Series(np.arange(4.), index=['a', 'b', 'c', 'd'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [18]:
obj['b']

np.float64(1.0)

In [19]:
obj[1]

/tmp/ipykernel_25050/2469632899.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[1]

np.float64(1.0)

In [20]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [21]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [22]:
obj[[1, 3]]

/tmp/ipykernel_25050/2982346117.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  obj[[1, 3]]

b    1.0
d    3.0
dtype: float64

In [23]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [24]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [25]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [26]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
index=['Chelyabinsk', 'Magnitogorsk', 'Uchali', 'Miass'],
columns=['one', 'two', 'three', 'four'])
data

              one  two  three  four
Chelyabinsk     0    1      2     3
Magnitogorsk    4    5      6     7
Uchali          8    9     10    11
Miass          12   13     14    15

In [27]:
data['two']

Chelyabinsk      1
Magnitogorsk     5
Uchali           9
Miass           13
Name: two, dtype: int64

In [28]:
data[['three', 'one']]

              three  one
Chelyabinsk       2    0
Magnitogorsk      6    4
Uchali           10    8
Miass            14   12

In [29]:
data[:2]

              one  two  three  four
Chelyabinsk     0    1      2     3
Magnitogorsk    4    5      6     7

In [30]:
data[data['three'] > 5]

              one  two  three  four
Magnitogorsk    4    5      6     7
Uchali          8    9     10    11
Miass          12   13     14    15

In [31]:
data < 5

                one    two  three   four
Chelyabinsk    True   True   True   True
Magnitogorsk   True  False  False  False
Uchali        False  False  False  False
Miass         False  False  False  False

In [32]:
data[data < 5] = 0
data

              one  two  three  four
Chelyabinsk     0    0      0     0
Magnitogorsk    0    5      6     7
Uchali          8    9     10    11
Miass          12   13     14    15

Выборка с помощью loc и iloc

In [33]:
data.loc['Magnitogorsk', ['two', 'three']]

two      5
three    6
Name: Magnitogorsk, dtype: int64

In [34]:
data.iloc[2, [3, 0, 1]]

four    11
one      8
two      9
Name: Uchali, dtype: int64

In [35]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Uchali, dtype: int64

In [36]:
data.iloc[[1, 2], [3, 0, 1]]

              four  one  two
Magnitogorsk     7    0    5
Uchali          11    8    9

In [37]:
data.loc[:'Uchali', 'two']

Chelyabinsk     0
Magnitogorsk    5
Uchali          9
Name: two, dtype: int64

In [38]:
data.iloc[:, :3][data.three > 5]

              one  two  three
Magnitogorsk    0    5      6
Uchali          8    9     10
Miass          12   13     14

## Задание 1
Привидите практические примеры всех аргументов функции reindex со своими примерами, перечисленных выше. В
отдельной строке перед примером необходимо дать описание каждого аргумента
Аргументы функции reindex: index; method; fill_value; limit; tolerance; level; copy.

In [39]:
import pandas as pd

# 1. index
# Аргумент index позволяет задать новый индекс для объекта.
df = pd.DataFrame({'A': [1, 2, 3]}, index=['a', 'b', 'c'])
df_reindexed = df.reindex(['b', 'c', 'd'])  # Новый индекс: 'b', 'c', 'd'
print(df_reindexed)

     A
b  2.0
c  3.0
d  NaN

In [40]:
# 2. method
# Аргумент method позволяет указать метод интерполяции для заполнения пропусков.
df = pd.DataFrame({'A': [1, 2, None]}, index=['a', 'b', 'c'])
df_reindexed = df.reindex(['a', 'b', 'c', 'd'], method='ffill')  # Заполнение вперед
print(df_reindexed)

     A
a  1.0
b  2.0
c  NaN
d  NaN

In [41]:
# 3. fill_value
# Аргумент fill_value позволяет задать значение, которым будут заполнены пропуски.
df = pd.DataFrame({'A': [1, 2, 3]}, index=['a', 'b', 'c'])
df_reindexed = df.reindex(['a', 'b', 'c', 'd'], fill_value=0)  # Заполнение нулями
print(df_reindexed)

   A
a  1
b  2
c  3
d  0

In [42]:
# 4. limit
# Аргумент limit задает максимальное количество заполнений, которые могут быть выполнены.
df = pd.DataFrame({'A': [1, None, None]}, index=['a', 'b', 'c'])
df_reindexed = df.reindex(['a', 'b', 'c', 'd'], method='ffill', limit=1)  # Ограничение на 1 заполнение
print(df_reindexed)

     A
a  1.0
b  NaN
c  NaN
d  NaN

In [43]:
# 5. tolerance
# Аргумент tolerance позволяет задать допустимое отклонение для метода интерполяции.
df = pd.DataFrame({'A': [1, 2, 3]}, index=[0, 1, 2])
df_reindexed = df.reindex([0, 1, 2, 3], method='nearest', tolerance=1)  # Ближайший индекс с допустимым отклонением
print(df_reindexed)

   A
0  1
1  2
2  3
3  3

In [44]:
# 6. level
# Аргумент level используется для работы с многоуровневыми индексами.
index = pd.MultiIndex.from_tuples([('A', 1), ('A', 2), ('B', 1)], names=['letter', 'number'])
df = pd.DataFrame({'value': [10, 20, 30]}, index=index)
df_reindexed = df.reindex(level='letter', index=['A', 'B', 'C'])  # Переписываем по уровню 'letter'
print(df_reindexed)

               value
letter number
A      1          10
       2          20
B      1          30

In [45]:
# 7. copy
# Аргумент copy указывает, следует ли создавать копию данных.
df = pd.DataFrame({'A': [1, 2, 3]}, index=['a', 'b', 'c'])
df_reindexed = df.reindex(['a', 'b', 'c', 'd'], copy=True)  # Создание копии данных
print(df_reindexed)

     A
a  1.0
b  2.0
c  3.0
d  NaN

## Задание 2
Привидите практические примеры всех Варианты доступа по индексу со своими примерами, перечисленных выше. В
отдельной строке перед примером необходимо дать описание Варианты доступа по индексу.
Варианты доступа по индексу для объекта DataFrame: df[val]; df.loc[val]; obj.loc[:, val]; df.iloc[val1, val2]; df.iloc[where];
obj.iloc[:, where]; df.loc[where_i, where_j]; df.at[label_i, label_j]; df.iat[label_i, label_j]; метод reindex; методы get_value,
set_value.

In [46]:
import pandas as pd

# Создаем пример DataFrame
data = {
    'A': [1, 2, 3],
    'B': [4, 5, 6],
    'C': [7, 8, 9]
}
df = pd.DataFrame(data, index=['a', 'b', 'c'])
df

   A  B  C
a  1  4  7
b  2  5  8
c  3  6  9

In [47]:
# 1. df[val]
# Доступ к столбцу по имени.
column_A = df['A']  # Получаем столбец 'A'
column_A

a    1
b    2
c    3
Name: A, dtype: int64

In [48]:
# 2. df.loc[val]
# Доступ к строке по метке индекса.
row_b = df.loc['b']  # Получаем строку с индексом 'b'
row_b

A    2
B    5
C    8
Name: b, dtype: int64

In [49]:
# 3. obj.loc[:, val]
# Доступ ко всем строкам для указанного столбца.
column_B = df.loc[:, 'B']  # Получаем все строки столбца 'B'
column_B

a    4
b    5
c    6
Name: B, dtype: int64

In [50]:
# 4. df.iloc[val1, val2]
# Доступ по позициям (целочисленным индексам).
value = df.iloc[1, 2]  # Получаем значение из строки 1 и столбца 2
value

np.int64(8)

In [51]:
# 5. df.iloc[where]
# Доступ по условию, возвращающему булев массив.
filtered_rows = df.iloc[df['A'] > 1]  # Получаем строки, где значение в столбце 'A' больше 1
filtered_rows

ValueError: iLocation based boolean indexing cannot use an indexable as a mask

In [52]:
# 6. obj.iloc[:, where]
# Доступ ко всем строкам для указанных позиций столбцов.
selected_columns = df.iloc[:, [0, 2]]  # Получаем столбцы с индексами 0 и 2
selected_columns

   A  C
a  1  7
b  2  8
c  3  9

In [53]:
# 7. df.loc[where_i, where_j]
# Доступ по меткам индекса для строк и столбцов.
value_at = df.loc['a', 'C']  # Получаем значение из строки 'a' и столбца 'C'
value_at

np.int64(7)

In [54]:
# 8. df.at[label_i, label_j]
# Доступ к отдельному элементу по меткам индекса.
value_at_label = df.at['b', 'A']  # Получаем значение из строки 'b' и столбца 'A'
value_at_label

np.int64(2)

In [55]:
# 9. df.iat[label_i, label_j]
# Доступ к отдельному элементу по позициям (целочисленным индексам).
value_at_iat = df.iat[2, 1]  # Получаем значение из строки 2 и столбца 1
value_at_iat

np.int64(6)

In [56]:
# 10. метод reindex
# Изменение индекса DataFrame.
df_reindexed = df.reindex(['a', 'b', 'c', 'd'])  # Добавляем новый индекс 'd'
df_reindexed

     A    B    C
a  1.0  4.0  7.0
b  2.0  5.0  8.0
c  3.0  6.0  9.0
d  NaN  NaN  NaN

In [ ]:






















# 11. методы get_value, set_value
# get_value - доступ к элементу по меткам индекса (устаревший метод).
# set_value - установка значения по меткам индекса (устаревший метод).
# Вместо них рекомендуется использовать df.at и df.iat.
# Пример использования get_value (устаревший):
# value_get = df.get_value('a', 'B')  # Получаем значение из строки 'a' и столбца 'B'
# print(value_get)

# Пример использования set_value (устаревший):
# df.set_value('c', 'A', 10)  # Устанавливаем значение 10 в строку 'c' и столбец 'A'
# print(df)